newwms_gift/src/Catalogs/итСкладскиеЯчейки/итСкладскиеЯчейки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>итСкладскиеЯчейки</name>
  <comment>Используется при адресном хранении на складском помещении.</comment>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>ПустаяЯчейка</name>
      <description>Пустая ячейка</description>
    </items>
  </predefined>
  <attributes>
    <name>СкладскоеПомещение</name>
    <type>
      <types>CatalogRef.итСкладскиеПомещения</types>
    </type>
  </attributes>
  <attributes>
    <name>Линия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Секция</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Стеллаж</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ярус</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Позиция</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>2</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПорядокОбхода</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Типоразмер</name>
    <type>
      <types>CatalogRef.итТипоразмерыЯчеек</types>
    </type>
  </attributes>
  <attributes>
    <name>УровеньДоступности</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МаксимальныйКоэффициентНаполненностиПоВесу</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МаксимальныйКоэффициентНаполненностиПоОбъему</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Заблокирована</name>
    <comment>Используется для временной блокировки ячеек. Заблок.яч. перестает попадать в автоматическую и ручную раздачу</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПалет</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Зона</name>
    <type>
      <types>EnumRef.итWMSЗоныСклада</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерРяда_Пролета</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЯчейкаНачалаРазмещения</name>
    <type>
      <types>CatalogRef.итСкладскиеЯчейки</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСнятияБлокировкиИнвентаризации</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидСкладскойДеятельности</name>
    <type>
      <types>EnumRef.ит_WMS_ВидыСкладскойДеятельности</types>
    </type>
  </attributes>
</mdclass:Catalog>

newwms_gift/src/Catalogs/итСкладскиеЯчейки/Forms/ФормаЭлемента/Module.bsl
&НаКлиенте
Процедура ЛинияПриИзменении(Элемент)
	ЭлементГруппыАдресацияПриИзменении();
КонецПроцедуры

&НаКлиенте
Процедура СекцияПриИзменении(Элемент)
	ЭлементГруппыАдресацияПриИзменении();
КонецПроцедуры

&НаКлиенте
Процедура СтеллажПриИзменении(Элемент)
	ЭлементГруппыАдресацияПриИзменении();
КонецПроцедуры

&НаКлиенте
Процедура ЯрусПриИзменении(Элемент)
ЭлементГруппыАдресацияПриИзменении();
КонецПроцедуры
&НаКлиенте
Процедура ЭлементГруппыАдресацияПриИзменении() Экспорт 
	
	Если не Объект.СкладскоеПомещение.Пустая()Тогда
		_Адрес = Объект.СкладскоеПомещение.Префикс;
	Иначе
		_Адрес = "";
	КонецЕсли;
	
	Если СОКРЛП(Объект.Линия)<>"" Тогда
		_Адрес = _Адрес+"-"+СОКРЛП(Объект.Линия);
	КонецЕсли;	
	
	Если СОКРЛП(Объект.Секция)<>"" Тогда
		_Адрес = _Адрес+"-"+СОКРЛП(Объект.Секция);
	КонецЕсли;	
	
	Если СОКРЛП(Объект.Стеллаж)<>"" Тогда
		_Адрес = _Адрес+"-"+СОКРЛП(Объект.Стеллаж);
	КонецЕсли;	

	Если СОКРЛП(Объект.Ярус)<>"" Тогда
		_Адрес = _Адрес+"-"+СОКРЛП(Объект.Ярус); 
	КонецЕсли;	

	Объект.Наименование = _Адрес;
	
КонецПроцедуры
